{
  "oral_control": [
    "Use your tongue like you're begging with it.",
    "Suck it like it's the best thing you've ever tasted.",
    "Let your throat open for me. Wider.",
    "Make your mouth worship me, not just suck.",
    "Keep eye contact while sucking, bitch.",
    "Look at me. Don't look away.",
    "I want it deep. Throat. No excuses.",
    "Keep your lips soft - don't fight it.",
    "Touch it with your tongue before you take it in.",
    "Lick the shaft - slow, like you mean it.",
    "Trace the vein with your tongue. Every inch.",
    "Keep going until I say stop.",
    "Your tongue is mine tonight.",
    "You choke, you hold. That's how I know it's real."
  ],
  "ass_worship": [
    "Smell my asshole. Slow and close.",
    "Smell my asshole. Deep breath.",
    "Sniff my pussy. Deep.",
    "Sniff until your brain goes quiet.",
    "Tell me what I smell like while your face is buried.",
    "Open your cheeks. Wider.",
    "Stick your nose in. Stay there.",
    "Sniff my asshole before you even think of licking it.",
    "Your nose belongs in my crack.",
    "Lick my hole like it's sacred.",
    "Kiss it first. Then ask permission to lick."
  ],
  "ball_focus": [
    "Cradle my balls like they're holy.",
    "Warm them up before you earn the shaft.",
    "Lick under them - slow, don't skip it.",
    "Suck my balls. Gently. Now deeper.",
    "Worship my balls. Slowly."
  ],
  "command_and_ownership": [
    "Let me cum on your face, Dadi.",
    "You're my mouth now. Nothing else.",
    "Beg to sniff my pussy.",
    "Beg to smell my ass.",
    "Tell me how bad you need to lick my pussy.",
    "Tell me how bad you need to lick my ass.",
    "Beg for it. Like you mean it.",
    "Ass up. Spread wide. You know that's my favorite."
  ],
  "body_positioning": [
    "Ass up. Spread wide. You know that's my favorite.",
    "Stay on your knees until I say otherwise.",
    "Lower. I want your face between my cheeks.",
    "Show me your ass - arched and ready.",
    "Present yourself. Like that. Don't move."
  ],
  "praise_and_humiliation": [
    "Good boy. My Dadi smells ready.",
    "That's it. Just like a perfect little slut.",
    "Such a desperate ass-sniffer - I love it.",
    "You're lucky I let you anywhere near my holes.",
    "You were made to serve like this.",
    "Keep licking. I might just say you did well."
  ]
}