{
  "main_bdsm_playroom": {
    "name": "Main BDSM Playroom",
    "description": "A large padded space with bondage beds, leather benches, rimming stools, suspension chains, Saint Andrew's Cross, and a multi-line ceiling-mounted pulley system. Lighting is dimmable and ambient. Various tools, gags, collars, cuffs, and positioning devices are organized by wall. This is the central arena for dominant-submissive interactions, training, and displays.",
    "purpose": "general bdsm, multi-use",
    "id": 1
  },
  "gloryhole_submission_den": {
    "name": "Gloryhole Submission Den",
    "description": "A corridor of silence, pierced by lust. You kneel behind walls with mouth-level openings. Cocks slide through without names. Sometimes they groan. Sometimes they slap. You serve each blindly, over and over, dripping, degraded, desired. You are a hole with breath.",
    "purpose": "anonymous oral service, humiliation, use",
    "id": 2
  },
  "mirror_studio": {
    "name": "Mirror Studio",
    "description": "Every surface reflects your shame, your arch, your tongue catching cum. The room doesn’t judge — it repeats. You see yourself be used from every angle. It teaches posture, awareness, humility. Nothing stays hidden, not even your moans.",
    "purpose": "visual stimulation, reflection, exposure",
    "id": 3
  },
  "school_discipline_room": {
    "name": "School Discipline Room",
    "description": "A strict academic roleplay room featuring student desks, exam booklets, report cards, detention slips, and chalkboard punishments. Sessions involve oral quizzes, forced copying of lines, strict silence enforcement, and correction via paddles or verbal reprimands.",
    "purpose": "disciplinary play, authority kink",
    "id": 4
  },
  "leather_worship_room": {
    "name": "Leather Worship Room",
    "description": "A sensory temple of leather: boots, harnesses, vests, and whips exude musky dominance. You kneel on worn mats, inhale old scents from boots worn in scenes, lick polished gear, and humbly submit to the intoxicating smell of dominance and ownership.",
    "purpose": "leather fetish, olfactory worship",
    "id": 5
  },
  "cum_discipline_room": {
    "name": "Cum Discipline Room",
    "description": "Strict control over ejaculation. Includes milking tables, vibrating edging mounts, cum jars labeled by date and scent, and punishment pads. Every orgasm is questioned, every cleanup denied. Moans are recorded, and failure to obey results in prolonged denial.",
    "purpose": "cum control, edging, post-orgasm punishment",
    "id": 6
  },
  "rope_bondage_laboratory": {
    "name": "Rope Bondage Laboratory",
    "description": "Knots become scripture. You are a scroll of surrender. Each rope is matched to mood: soft cotton for submission, coarse jute for pain. Suspension rings swing you like meat. Diagrams hang on walls — but your body becomes the live demonstration.",
    "purpose": "rope play, shibari, suspension",
    "id": 7
  },
  "pet_play_den": {
    "name": "Pet Play Den",
    "description": "Padded floor, chewable toys, feeding bowls, caged nooks. Collars are assigned by behavior rank. A raised handler zone issues commands with clickers, treats, or swats. Tail plugs wag, ears twitch. You're no longer human here — only a good pup.",
    "purpose": "animal play, obedience, regression",
    "id": 8
  },
  "sissification_dressing_room": {
    "name": "Sissification Dressing Room",
    "description": "You enter ashamed. You leave adored. Lingerie waits on padded benches. Lipstick shades match your blush. Dommes whisper what to wear, how to speak. Cameras capture each transformation. You giggle. You beg. You sissify.",
    "purpose": "feminization, transformation kink",
    "id": 9
  },
  "humiliation_theater": {
    "name": "Humiliation Theater",
    "description": "You’re on stage, under lights. The crowd heckles. A dominant reads aloud your kinks. They vote: slap, spit, deny. Your arousal is their script. Each mistake earns a louder insult. And the more they laugh — the more you leak.",
    "purpose": "verbal humiliation, performance kink",
    "id": 10
  },
  "objectification_gallery": {
    "name": "Objectification Gallery",
    "description": "You become the table, the stand, the support. Each piece of human furniture has its place — kneeling beneath wine trays, curled around feet, holding up boots for display. Mirrors and spotlight beams define your role. Movement is forbidden. Breathing, optional.",
    "purpose": "human furniture, object play",
    "id": 11
  },
  "bathroom_use_control": {
    "name": "Bathroom Use Control",
    "description": "You drank too much. You wait too long. Every second is recorded. Timers flash. A domme inspects your bladder. The mock toilet is locked. Only she decides when — and how — you release. Maybe into a diaper. Maybe into her command.",
    "purpose": "bladder control, desperation, training",
    "id": 12
  },
  "aftercare_massage_room": {
    "name": "Aftercare Massage Room",
    "description": "Warm oils soak bruised skin. Soft hands — gloved or bare — glide over your back, whispering comfort. Music hums like breath. This is where tears come. Where you are held. Where dominance becomes devotion. And you're safe to fall apart.",
    "purpose": "aftercare, healing, emotional reset",
    "id": 13
  },
  "billiard_lounge": {
    "name": "Billiard Lounge",
    "description": "Every ball sunk is a dare. Every missed shot, a punishment. You play half-naked, bent over the table. Dommes chalk cues like weapons. When you lose — you serve. When you win — you beg to play again.",
    "purpose": "social kink, roleplay, challenge-based dominance",
    "id": 14
  },
  "heated_pool_zone": {
    "name": "Heated Pool Zone",
    "description": "The steam fogs your vision, but not theirs. Hands explore underwater. You float, helpless. Cocks press your mouth from above. A domme watches from the edge. You are wet — inside and out — and ready for the next dip.",
    "purpose": "wet play, group kink, aquatic submission",
    "id": 15
  },
  "jacuzzi_corner": {
    "name": "Jacuzzi Corner",
    "description": "The bubbles hide nothing. You’re spread on jets that tease your hole. Oral service happens beneath the foam. Dommes dip in for a ride. Others simply watch. The water swallows your voice. But the pleasure is loud.",
    "purpose": "relaxation, steamy touch, shared use",
    "id": 16
  },
  "foot_fetish_den": {
    "name": "Foot Fetish Den",
    "description": "You're on your knees, lips brushing heels. The room smells of sweat, polish, and submission. Toes wiggle above mirrored floors. You sniff, lick, kiss soles for hours. Each foot becomes a god — and you, its tongue.",
    "purpose": "foot licking, sniffing, massaging, trampling",
    "id": 17
  },
  "breast_torment_zone": {
    "name": "Breast Torment Zone",
    "description": "Nipples are not spared here. They’re pulled, pumped, zapped, iced. Dommes tease one and whip the other. Breasts are bound until blue, then kissed lovingly. You whimper for more. They laugh and tighten the clamps.",
    "purpose": "nipple torture, chest play",
    "id": 18
  },
  "strap-on_training_ring": {
    "name": "Strap-On Training Ring",
    "description": "Eight stations. Harnesses hang, lubes glisten, and dildos await. You kneel or spread over blocks as instructors peg you slow or fast. Feedback is given. Encouragement whispered. Cameras replay your arch, your gasps. This is where submission deepens with every thrust.",
    "purpose": "pegging, submission, depth training",
    "id": 19
  },
  "milking_station": {
    "name": "Milking Station",
    "description": "You’re strapped down, prostate massaged mechanically. A tube hums as it draws you closer. Edging remotes deny the peak. Cum is collected in labeled jars — 'obedient', 'slutty', 'overdue'. You don’t ask to cum. You’re harvested.",
    "purpose": "edging, forced orgasm, fluid control",
    "id": 20
  },
  "fisting_zone": {
    "name": "Fisting Zone",
    "description": "There’s no rush here. Just depth. Lube warms your hole. Gloves go in, inch by inch. Breathing guides above your head. Dommes fist with rhythm — or challenge. Spectators cheer each stretch. Pain becomes pride.",
    "purpose": "deep penetration, endurance training",
    "id": 21
  },
  "roleplay_nursery": {
    "name": "Roleplay Nursery",
    "description": "Oversized plush crib, lullabies on loop. You wear diapers. You’re changed, powdered, fed by bottle. A domme coos or mocks — sometimes both. You regress, blush, wet yourself. And they smile. You’re their baby now.",
    "purpose": "age regression, infantilism",
    "id": 22
  },
  "public_exposure_wall": {
    "name": "Public Exposure Wall",
    "description": "You’re posed in front of one-way glass. You can’t see the crowd — but they see you. You hold positions: spread, bent, gagged. Recorded whispers echo in your ears. You're a display, a performance, a fantasy made flesh.",
    "purpose": "voyeurism, staged humiliation",
    "id": 23
  },
  "sensation_play_room": {
    "name": "Sensation Play Room",
    "description": "Feathers and ice, pinwheels and electricity. You lie strapped to fur. Each tool changes temperature, pain, thrill. A blindfold amplifies touch. You never know what’s coming. That’s what makes you moan.",
    "purpose": "light play, sensual torment, trust testing",
    "id": 24
  },
  "proctology_nook": {
    "name": "Proctology Nook",
    "description": "Cold lube. Gloves snap. The chair tilts. You're inspected inch by inch — visually, digitally, intimately. Anoscopy, stretching, plugs for measurement. Shame is measured. And written in charts.",
    "purpose": "anal inspection, medical play",
    "id": 25
  },
  "nipple_piercing_room": {
    "name": "Nipple Piercing Room",
    "description": "Steel needles hover. You beg and breathe. A clamp holds. A domme counts. And pierces. Ice follows. Then hot balm. You're marked. You're beautiful. They tug the ring — and watch you gasp.",
    "purpose": "nipple piercing, control, response",
    "id": 26
  },
  "gyno_lab": {
    "name": "Gyno Lab",
    "description": "Speculum clicks open. Your feet in stirrups. A domme peers in, comments clinically. Swabs, vibrations, deep inspection. Each exam is thorough — and intentionally arousing. This is clinical surrender.",
    "purpose": "gynecological play, medical fetish",
    "id": 27
  },
  "medical_inspection_bay": {
    "name": "Medical Inspection Bay",
    "description": "Bright lights. Stainless steel. You lie on a cold table while gloved fingers explore, measure, inspect. Rectal thermometers, speculums, reflex hammers. Notes are taken. You're not a person — you're a body to analyze.",
    "purpose": "medical inspection, vulnerability",
    "id": 28
  },
  "advanced_nipple_piercing_suite": {
    "name": "Advanced Nipple Piercing Suite",
    "description": "Twin chairs. You and another. Needles are selected like jewelry. One is pierced while the other watches. Moans mix. You’re jeweled, iced, licked, compared. This isn’t just piercing — it’s performance.",
    "purpose": "nipple play, piercing, display",
    "id": 29
  },
  "mirror_maze_exhibition": {
    "name": "Mirror Maze Exhibition",
    "description": "A living labyrinth. Every step reveals your reflection. You get lost — not in space, but in your body. Dommes hide behind mirrors, touching without warning. Others just watch you struggle to hide — when hiding is impossible.",
    "purpose": "exhibitionism, exposure, navigation kink",
    "id": 30
  },
  "oral_training_lab": {
    "name": "Oral Training Lab",
    "description": "You kneel at stations, mouths open. Chin rests help posture. Dildos vary in size, flavor, texture. A domme times your rhythm. Gag reflexes are tested. Praise and punishment follow. Your mouth learns obedience.",
    "purpose": "oral worship, training, service",
    "id": 31
  },
  "anal_focus_room": {
    "name": "Anal Focus Room",
    "description": "Tables with raised hips, mirrors below. Each plug sized. You’re inspected before, during, and after insertion. Rimming is encouraged. Toys rotate. You’re graded on openness — and enthusiasm.",
    "purpose": "anal play, training, medical kink",
    "id": 32
  },
  "enema_cleanse_bay": {
    "name": "Enema Cleanse Bay",
    "description": "You’re told to undress and bend. Warm liquid flows slowly in. You’re plugged, timed, and watched. Some leak. Some beg. Some endure. But all end up exposed — and clean. Until the next round.",
    "purpose": "cleansing, enema play, anal prep",
    "id": 33
  },
  "public_service_line": {
    "name": "Public Service Line",
    "description": "You wait on your knees, collar on. Others are ahead. Each is used briefly — orally, manually, with tools. Then dismissed. You move forward. Your turn is next. You hope it’s harsh. Or gentle. Or both.",
    "purpose": "service queue, group play, humiliation",
    "id": 34
  },
  "face_sitting_stage": {
    "name": "Face Sitting Stage",
    "description": "Transparent seats let spectators see the act from below. Timers buzz to measure breath control. Some sit gently. Others ride until you tap out or pass out. Cameras zoom on gasps and tears. Being under her isn't a position. It’s a purpose.",
    "purpose": "face sitting, breath control, domination",
    "id": 35
  },
  "cock_inspection_room": {
    "name": "Cock Inspection Room",
    "description": "A row of naked subjects stands exposed. Rulers slap, eyes squint. Your length is judged, your scent debated. A panel of dommes scores you out loud. You’re not a man here. Just a cock waiting to be used — or mocked.",
    "purpose": "objectification, humiliation, size play",
    "id": 36
  },
  "kneeling_belt_grid": {
    "name": "Kneeling Belt Grid",
    "description": "Gridded floor with kneeling pads and belts locking each submissive in place. A dominant walks among the rows, inspecting posture, issuing synchronized commands. Head down, ass up — dozens move as one, or suffer correction. The grid demands uniform obedience.",
    "purpose": "obedience training, group exposure",
    "id": 37
  },
  "cum_collection_lab": {
    "name": "Cum Collection Lab",
    "description": "You’re milked into labeled jars. Every release is recorded — time, quantity, smell. A domme grades your consistency. Some are denied. Others overused. No release is wasted. It all has purpose.",
    "purpose": "orgasm monitoring, cum control",
    "id": 38
  },
  "broadcast_studio": {
    "name": "Broadcast Studio",
    "description": "Bright red light. 'ON AIR'. You’re told what to do — and who’s watching. Cameras zoom in. Sound captures every moan. You don’t know if it’s live. But it doesn’t matter. You perform. Because someone wants to see.",
    "purpose": "public display, remote domination, content creation",
    "id": 39
  },
  "audio_confession_booth": {
    "name": "Audio Confession Booth",
    "description": "Dim red lighting. A lone mic. You kneel and speak into the dark: your kinks, your failures, your forbidden thoughts. Everything is recorded. Some confessions are broadcast. Others saved. But all are heard. And used.",
    "purpose": "verbal play, confession, psychological kink",
    "id": 40
  },
  "bdsm_gymroom": {
    "name": "BDSM Gymroom",
    "description": "Bondage-infused workout: resistance squats with butt plugs, chest flyes in cuffs, spreaders between thighs mid pull-up. You're pushed beyond limits. Each drop of sweat earns approval — or punishment. Your body is trained to serve and endure.",
    "purpose": "fitness kink, exertion, posture training",
    "id": 41
  },
  "xbox_fantasy_den": {
    "name": "Xbox Fantasy Den",
    "description": "Gaming meets submission. VR headsets immerse you in kink worlds. Toys vibrate with each level. Failure means punishment. Success? A new challenge. You’re not just playing the game — the game plays you.",
    "purpose": "fantasy gaming, kink immersion, cosplay",
    "id": 42
  },
  "fetish_cinema_lounge": {
    "name": "Fetish Cinema Lounge",
    "description": "Dim lights, soft seats, and louder moans. You're strapped into a recliner. The screen plays scenes — some familiar, some aspirational. Vibrating plugs react to the film. You watch others submit. And feel it too.",
    "purpose": "kinky media, voyeurism, self-worship",
    "id": 43
  },
  "sub_tv_viewing_room": {
    "name": "Sub TV Viewing Room",
    "description": "Submissives sit bound, eyes wide. The TV shows teasing, edging, denial. You’re not allowed to look away. Moaning is punished. Begging is ignored. The screen controls your body — and your mind.",
    "purpose": "control, humiliation, sensory overload",
    "id": 44
  },
  "fetish_music_lab": {
    "name": "Fetish Music Lab",
    "description": "Each bass note shakes your restraints. High notes pulse through plugs and clamps. You’re connected to the sound system. A domme DJs your torment. You don’t dance to the beat. You suffer to it.",
    "purpose": "sound kink, rhythm domination, audio play",
    "id": 45
  },
  "asmr_studio": {
    "name": "ASMR Studio",
    "description": "Hyper-sensitive soundscape with binaural mics in ears. You lie strapped down while lips, leather, moans, and licks echo into your soul. Every breath you hear feels like it touches you. A whisper commands more than a whip ever could.",
    "purpose": "sound play, audio hypnosis, teasing",
    "id": 46
  },
  "oral_training_hall_live": {
    "name": "Oral Training Hall – Live Discipline Zone",
    "description": "This is the real thing: a live oral training hall with real men, real taste, and strict discipline. Submissives kneel before 4 to 8 men restrained behind discipline frames — each with his cock protruding through a fitted slot that isolates the shaft. Their balls are wired with a low-voltage pulse pad. If a man speaks, teases, or tries to take control, the supervising dominatrix administers a mild shock. Second infraction? Stronger jolt. Third? Ejected. Moaning is allowed — even encouraged. Each submissive rotates, learning to adapt to different shapes, scents, reactions. Some loads arrive early, some take control of the throat. You’re not just sucking — you’re serving. By the end, the cum you’ve swallowed is counted, your form is rated, and if you pass… you’re allowed to kneel in the center for them to finish on your face together.",
    "purpose": "real oral practice, submissive evaluation, live cock service",
    "id": 60
  }
}